twoFloatingObjects/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject -noFields
mv log.subsetMesh log.subsetMesh0
mv log.topoSet log.topoSet0
runApplication topoSet
runApplication subsetMesh -overwrite c1 -patch floatingObject2 -noFields
runApplication setFields
runApplication $application
touch case.foam
#------------------------------------------------------------------------------
